// Lab_1(Mtd8).cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
/*
1. Написать программу, которая, в зависимости от выбора пользователя, в консоли должна выводить названия стран мира, с использованием пере-числений.
2. Написать программу, в которой в конец/в начало массива добавляется n элементов и вывести на экран.
3. Написать программу, в которой нужно найти среднее арифметическое элементов вектора и вывести его на экран.
4. Написать программу, в которой нужно найти максималь-ный/минимальный элемент дэки и добавить его в конец/в начало, с выво-дом на экран.
5. Написать программу, в которой нужно удалить все элементы односвяз-ного списка и добавить n новых, с выводом на экран.
6. Написать программу, в которой в начало/в конец двусвязного списка добавляется n элементов и вывести на экран.
7. Написать программу, которая будет искать введённое пользователем число в map.
*/

#include "Header.h"
using namespace std;
int main()
{
	openProgramMenu();
}
